import time
import re
import urllib2
aa="http://sou.zhaopin.com/jobs/searchresult.ashx?bj="
ab="&jl="
ac="&sm=0&p=1&sf=0&st=99999&isadv=1"
find=re.compile(r"\<em\>\d+\<\/em\>")
times=time.strftime('%Y-%m-%d')
city=["北京","上海","天津","重庆","广西","安徽 ","广东","湖北","陕西","四川","辽宁","吉林","江苏","山东","浙江","河北","山西","内蒙古","福建","江西","河南","湖南","海南","贵州","云南","西藏 ","甘肃","青海","宁夏","新疆 ","黑龙江","香港","澳门","台湾"]
citycode=["%E5%8C%97%E4%BA%AC","%E4%B8%8A%E6%B5%B7","%E5%A4%A9%E6%B4%A5","%E9%87%8D%E5%BA%86","%E5%B9%BF%E8%A5%BF","%E5%AE%89%E5%BE%BD","%E5%B9%BF%E4%B8%9C","%E6%B9%96%E5%8C%97","%E9%99%95%E8%A5%BF","%E5%9B%9B%E5%B7%9D","%E8%BE%BD%E5%AE%81","%E5%90%89%E6%9E%97","%E6%B1%9F%E8%8B%8F","%E5%B1%B1%E4%B8%9C","%E6%B5%99%E6%B1%9F","%E6%B2%B3%E5%8C%97","%E5%B1%B1%E8%A5%BF","%E5%86%85%E8%92%99%E5%8F%A4","%E7%A6%8F%E5%BB%BA","%E6%B1%9F%E8%A5%BF","%E6%B2%B3%E5%8D%97","%E6%B9%96%E5%8D%97","%E6%B5%B7%E5%8D%97","%E8%B4%B5%E5%B7%9E","%E4%BA%91%E5%8D%97","%E8%A5%BF%E8%97%8F","%E7%94%98%E8%82%83","%E9%9D%92%E6%B5%B7","%E5%AE%81%E5%A4%8F","%E6%96%B0%E7%96%86","%E9%BB%91%E9%BE%99%E6%B1%9F","%E9%A6%99%E6%B8%AF","%E6%BE%B3%E9%97%A8","%E5%8F%B0%E6%B9%BE%E7%9C%81"]
job=["销售业务","销售管理","销售行政/商务"," 客户服务/售前/售后支持 ","市场","公关/媒介","广告/会展","财务/审计/税务","人力资源"," 行政/后勤/文秘","项目管理/项目协调 ","质量管理/安全防护"," 高级管理"," 软件/互联网开发/系统集成","硬件开发","互联网产品/运营管理","IT质量管理/测试/配置管理","IT运维/技术支持"," IT管理/项目协调","电信/通信技术开发及应用"," 房地产开发/经纪/中介","土木/建筑/装修/市政工程","物业管理","银行","证券/期货/投资管理/服务","保险","信托/担保/拍卖/典当","采购/贸易"," 交通运输服务 ","物流/仓储"," 生产管理/运营","电子/电器/半导体/仪器仪表 "," 汽车制造 ","汽车销售与服务","机械设计/制造/维修"," 服装/纺织/皮革设计/生产"," 技工/操作工","生物/制药/医疗器械"," 化工 ","影视/媒体/出版/印刷"," 艺术/设计","咨询/顾问/调研/数据分析"," 教育/培训","律师/法务/合规","翻译（口译与笔译）","商超/酒店/娱乐管理/服务","旅游/度假/出入境服务","烹饪/料理/食品研发","保健/美容/美发/健身","医院/医疗/护理","社区/居民/家政服务","能源/矿产/地质勘查","环境科学/环保","农/林/牧/渔业","公务员/事业单位/科研机构","实习生/培训生/储备干部","志愿者/社会工作者","兼职/临时"," 其他" ]
jobcode=["4010200","7001000","7002000","4000000","4082000","4084000","7004000","2060000","5002000","3010000","201300","2023405","1050000","160000","160300","160200","160400","200500","200300","5001000","141000","140000","142000","2071000","2070000","7006000","200900","4083000","4010300","4010400","121100","160100","7003000","7003100","5003000","7005000","5004000","121300","120500","2120000","2100708","2140000","2090000","2080000","2120500","5005000","4040000","201100","2050000","2051000","6270000","130000","2023100","100000","200100","5006000","200700","300100","300200"]
i=range(34)
j=range(59)
for t in i:
    for q in j:
        z=aa+jobcode[q]+ab+citycode[t]+ac
        req=urllib2.urlopen(z)
        res=req.read()
        o=find.findall(res)
        c=re.compile(r"\d+")
        d=c.findall(str(o))
        foo=open("D:\d.txt",'a')
        mm=','
        foo.write(city[t])
        foo.write(mm)
        foo.write(job[q])
        foo.write(mm)
        foo.write(str(d))
        foo.write(mm)
        foo.write(times)
        foo.write("\n")
        foo.close()